=========================
single variable metavar
=========================

metavar a ::=

---

(source_file
  (metavardefn
    (id_desc
      (id))))

=========================
single variable indexvar
=========================

indexvar i ::=

---

(source_file
  (metavardefn
    (id_desc
      (id))))

=========================
multiple variables
=========================
metavar a, b, c ::=

---

(source_file
  (metavardefn
    (id_desc
      (id))
    (id_desc
      (id))
    (id_desc
      (id))))

=========================
multiple variables with varying whitespace
=========================
metavar a , b,c,d ::=

---

(source_file
  (metavardefn
    (id_desc
      (id))
    (id_desc
      (id))
    (id_desc
      (id))
    (id_desc
      (id))))

=========================
invalid trailing comma
:error
=========================
metavar a, b, ::=

---

============================
string as homomorphism body
============================
metavar a {{ tex \ell }}, b ::=

---

(source_file
  (metavardefn
    (id_desc
      (id)
      (homomorphism
        (hom_name)
        (hom_body)))
    (id_desc
      (id))))

============================
string as homomorphism body without inner whitespace
============================
metavar a {{tex \ell}}, b ::=

---

(source_file
  (metavardefn
    (id_desc
      (id)
      (homomorphism
        (hom_name)
        (hom_body)))
    (id_desc
      (id))))

============================
string as homomorphism body with no closing brace
:error
============================
metavar a {{tex \ell

---
============================
homInner as homomorphism body
============================
metavar a {{ tex [[gg]] }}, b ::=

---

(source_file
  (metavardefn
    (id_desc
      (id)
      (homomorphism
        (hom_name)
        (hom_body
          (hom_inner_block))))
    (id_desc
      (id))))

============================
multiple homomorphisms
============================
metavar a {{ tex [[gg]] }}, b {{ tex \normalcolor }}::=
---

(source_file
  (metavardefn
    (id_desc
      (id)
      (homomorphism
        (hom_name)
        (hom_body
          (hom_inner_block))))
    (id_desc
      (id)
      (homomorphism
        (hom_name)
        (hom_body)))))

============================
multiple identifiers in homInner
============================
metavar a {{ tex [[gg |- f]] }}, b ::=

---

(source_file
  (metavardefn
    (id_desc
      (id)
      (homomorphism
        (hom_name)
        (hom_body
          (hom_inner_block))))
    (id_desc
      (id))))
